app/Models/homeModel.php

    public function getHomeData()
    {
        return $this->findAll();
---
SELECT *
FROM `home`

    public function getAboutData()
    {
        return $this->db->table('about')->get()->getResultArray();
---
SELECT *
FROM `about`

    public function getFeatureData()
    {
        return $this->db->table('features')->get()->getResultArray();
---
SELECT *
FROM `features`

    public function getServicesData()
    {
        return $this->db->table('services')->get()->getResultArray();
---
SELECT *
FROM `services`

    public function getPricingData()
    {
        return $this->db->table('pricing')->get()->getResultArray();
---
SELECT *
FROM `pricing`

    public function getQuoteData()
    {
        return $this->db->table('quote')->get()->getResultArray();
---
SELECT *
FROM `quote`

    public function getTestimonialsData()
    {
        return $this->db->table('testimonial')->get()->getResultArray();
---
SELECT *
FROM `testimonial`

    public function getTeamData()
    {
        return $this->db->table('team')->get()->getResultArray();
---
SELECT *
FROM `team`

    public function getBrandLogo()
    {
        return $this->db->table('brand_logo')->get()->getResultArray();
---
SELECT *
FROM `brand_logo`

    public function addService($data)
    {
        return $this->db->table('services')->insert($data);
---
INSERT INTO `services` (`service_name`, `service_text`) VALUES ('fff', 'fff')

    public function deleteService($id)
    {
        // Change from update to delete
        return $this->db->table('services')->where('service_id', $id)->delete();
---
DELETE FROM `services`
WHERE `service_id` = '10'

public function getBrand($id)
{
    return $this->db->table('brand_logo')
                    ->where('brand_id', $id)
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `brand_logo`
WHERE `brand_id` = '10'

public function deleteBrand($id)
{
    return $this->db->table('brand_logo')->where('brand_id', $id)->delete();
---
DELETE FROM `brand_logo`
WHERE `brand_id` = '10'

    public function getHeaderAddress()
{
    return $this->db->table('header_adress')->get()->getRowArray();
---
SELECT *
FROM `header_adress`

public function updateHeaderAddress($data)
{
    return $this->db->table('header_adress')->where('header_id', 1)->update($data);
---
UPDATE `header_adress` SET `header_address` = 'Kohat KDA', `header_phone` = '03324234218', `header_email` = 'example@gmail.com', `twitter_url` = 'http://localhost/itconsultant/admin/headeraddress', `facebook_url` = 'http://localhost/itconsultant/admin/headeraddress', `linkedin_url` = 'http://localhost/itconsultant/admin/headeraddress', `instagram_url` = 'http://localhost/itconsultant/admin/headeraddress', `youtube_url` = 'http://localhost/itconsultant/admin/headeraddress'
WHERE `header_id` = 1

public function getContactData()
{
    return $this->db->table('contact_us')->get()->getRowArray();
---
SELECT *
FROM `contact_us`

public function updateContactData($data)
{
    return $this->db->table('contact_us')
                    ->where('contact_us_id', 1)
                    ->update($data);
---
UPDATE `contact_us` SET `heading` = 'If You Have Any Query, Feel Free To Contact Us', `phone_heading` = 'Call to ask any question', `phone_number` = '12345678', `email_heading` = 'Email to get free quote', `email` = 'info@example.com', `address_heading` = 'Visit our office near', `address` = '123 Street, NY, USA'
WHERE `contact_us_id` = 1

public function getFooterData()
{
    return $this->db->table('footer')->get()->getRowArray();
---
SELECT *
FROM `footer`

public function getHeaderLogo()
{
    return $this->db->table('header_logo')->get()->getRowArray();
---
SELECT *
FROM `header_logo`

public function countServices()
{
    return $this->db->table('services')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `services`

public function countTeamMembers()
{
    return $this->db->table('team')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `team`

public function countTestimonials()
{
    return $this->db->table('testimonial')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `testimonial`

public function countBrands()
{
    return $this->db->table('brand_logo')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `brand_logo`